{"format":"graph-model","generatedBy":"2.19.0","convertedBy":"TensorFlow.js Converter v4.22.0","signature":{"inputs":{"image":{"name":"image:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"224"},{"size":"224"},{"size":"3"}]}}},"outputs":{"output_0":{"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"3"}]}}}},"modelTopology":{"node":[{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"16"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1_2/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_2_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"24"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_3_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"24"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_4_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"32"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_5_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_6_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_7_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_8_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"64"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_9_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_10_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"96"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_11_1/convolution/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/batchnorm/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/batchnorm/sub","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/global_average_pooling2d_1/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/Cast/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"96"},{"size":"128"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/adjustments_1/Cast/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"},{"size":"3"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/adjustments_1/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"image","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"-1"},{"size":"224"},{"size":"224"},{"size":"3"}]}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/Cast","op":"Cast","input":["image"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-3"},{"size":"-4"},{"size":"-5"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"16"}]}]}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-3"},{"size":"-4"},{"size":"16"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1_2/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1_2/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-3"},{"size":"-4"},{"size":"16"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"16"}]}]}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1_2/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_1_2/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-3"},{"size":"-4"},{"size":"16"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_1_2/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_1_2/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_2_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_1_2/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_2_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-3"},{"size":"-4"},{"size":"16"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"24"}]}]}},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_2_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_2_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-6"},{"size":"-7"},{"size":"24"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_2_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_2_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_3_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_2_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_3_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-6"},{"size":"-7"},{"size":"24"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"24"}]}]}},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_3_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_3_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-6"},{"size":"-7"},{"size":"24"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_3_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_3_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_4_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_3_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_4_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-6"},{"size":"-7"},{"size":"24"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"32"}]}]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_4_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_4_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-8"},{"size":"-9"},{"size":"32"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_4_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_4_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_5_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_4_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_5_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-8"},{"size":"-9"},{"size":"32"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_5_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_5_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-8"},{"size":"-9"},{"size":"32"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_5_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_5_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_6_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_5_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_6_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-8"},{"size":"-9"},{"size":"32"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"48"}]}]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_6_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_6_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-10"},{"size":"-11"},{"size":"48"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_6_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_6_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_7_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_6_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_7_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-10"},{"size":"-11"},{"size":"48"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"48"}]}]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_7_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_7_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-10"},{"size":"-11"},{"size":"48"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_7_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_7_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_8_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_7_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_8_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-10"},{"size":"-11"},{"size":"48"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"64"}]}]}},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_8_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_8_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-12"},{"size":"-13"},{"size":"64"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_8_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_8_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_9_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_8_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_9_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-12"},{"size":"-13"},{"size":"64"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}]}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_9_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_9_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-12"},{"size":"-13"},{"size":"64"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_9_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_9_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_9_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_10_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_9_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_10_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-12"},{"size":"-13"},{"size":"64"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"96"}]}]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_10_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_10_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-14"},{"size":"-15"},{"size":"96"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_10_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_10_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_10_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_11_1/convolution","op":"Conv2D","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_10_1/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_11_1/convolution/Cast"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-14"},{"size":"-15"},{"size":"96"}]},{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"96"}]}]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_11_1/convolution"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/batchnorm/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/batchnorm/mul"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/batchnorm/mul_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/Cast_5","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/batchnorm/add_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_11_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/Cast_5"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"-14"},{"size":"-15"},{"size":"96"}]}]}},"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_11_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_11_1/Cast_5","StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_11_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/global_average_pooling2d_1/Cast","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/activation_11_1/mul_1"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/global_average_pooling2d_1/Mean","op":"Mean","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/global_average_pooling2d_1/Cast","StatefulPartitionedCall/synthetic_adjustment_cnn_1/global_average_pooling2d_1/Mean/reduction_indices"],"attr":{"T":{"type":"DT_FLOAT"},"Tidx":{"type":"DT_INT32"},"keep_dims":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/global_average_pooling2d_1/Cast_1","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/global_average_pooling2d_1/Mean"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/MatMul","op":"MatMul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/global_average_pooling2d_1/Cast_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/Cast/Cast"],"device":"/device:CPU:0","attr":{"grad_a":{"b":false},"transpose_a":{"b":false},"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"96"}]},{"dim":[{"size":"96"},{"size":"128"}]}]}},"T":{"type":"DT_HALF"},"grad_b":{"b":false},"transpose_b":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/BiasAdd","op":"BiasAdd","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/MatMul","StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/BiasAdd/Cast"],"attr":{"_input_shapes":{"list":{"shape":[{"dim":[{"size":"-2"},{"size":"128"}]},{"dim":[{"size":"128"}]}]}},"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/BiasAdd"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/BiasAdd","StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/Cast_1","op":"Cast","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/dense_1/mul_1"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/adjustments_1/Tanh","op":"_FusedMatMul","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/Cast_1","StatefulPartitionedCall/synthetic_adjustment_cnn_1/adjustments_1/Cast/ReadVariableOp","StatefulPartitionedCall/synthetic_adjustment_cnn_1/adjustments_1/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"transpose_a":{"b":false},"transpose_b":{"b":false},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"num_args":{"i":"1"},"leakyrelu_alpha":{"f":0.2},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"}}},{"name":"Identity","op":"Identity","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/adjustments_1/Tanh/UnfusedTanh"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/adjustments_1/Tanh/UnfusedTanh","op":"Tanh","input":["StatefulPartitionedCall/synthetic_adjustment_cnn_1/adjustments_1/Tanh"],"attr":{"T":{"type":"DT_FLOAT"}}}],"library":{},"versions":{"producer":2129}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1/convolution/Cast","shape":[3,3,3,16],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/mul","shape":[16],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1/batchnorm/sub","shape":[16],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_1_2/convolution/Cast","shape":[3,3,16,16],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/mul","shape":[16],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_1_2/batchnorm/sub","shape":[16],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_2_1/convolution/Cast","shape":[3,3,16,24],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/mul","shape":[24],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_2_1/batchnorm/sub","shape":[24],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_3_1/convolution/Cast","shape":[3,3,24,24],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/mul","shape":[24],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_3_1/batchnorm/sub","shape":[24],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_4_1/convolution/Cast","shape":[3,3,24,32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/mul","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_4_1/batchnorm/sub","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_5_1/convolution/Cast","shape":[3,3,32,32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/mul","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_5_1/batchnorm/sub","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_6_1/convolution/Cast","shape":[3,3,32,48],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/mul","shape":[48],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_6_1/batchnorm/sub","shape":[48],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_7_1/convolution/Cast","shape":[3,3,48,48],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/mul","shape":[48],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_7_1/batchnorm/sub","shape":[48],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/conv2d_8_1/convolution/Cast","shape":[3,3,48,64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/mul","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/synthetic_adjustment_cnn_1/batch_normalization_8_1/batchnorm/sub","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},